#!bin/ruby 
require_relative "request/base"

class Request
  include Base
  attr_reader :request

  def initialize
    @name = name
  end
      
  def save
    File.write("output/" + name, body) 
  end

  private

  def body
  end
end

class DetailsRequest < Request
  private

  def body
    "<Файл xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" ИдФайл=\"#{name}\" ВерсПрог=\"ЭОД v2.4.730.011\" ВерсФорм=\"5.02\">
    <Документ КНД=\"1184001\" ДатаДок=\"#{dot_date}\">
      <СвОтпр КодНО=\"6623\" />
      <СвПолуч ПризПолучУП=\"1\">
        <ПолучЮЛ НаимОрг=\"ЗАО МАО\" ИННЮЛ=\"0194202211\" КПП=\"019000000\" />
      </СвПолуч>
      <СвНП>
        <НПЮЛ НаимОрг=\"ЗАО МАО\" ИННЮЛ=\"0194202211\" КПП=\"019000000\" />
      </СвНП>
      <Подписант Должн=\"Повелитель инспекции\">
        <ФИО Фамилия=\"Очень\" Имя=\"Классный\" />
      </Подписант>
      <ИнфСообДок ВидФайлДок=\"1165023\" НомФайлДок=\"123456\" ДатаФайлДок=\"#{dot_date}\" КолФайл=\"1\">
        <ИмяФайл>#{name}</ИмяФайл>
      </ИнфСообДок>
    </Документ>
    </Файл>"
  end
end

class DocumentsRequest < Request
  private

  def body
    "<?xml version=\"1.0\" encoding=\"windows-1251\"?>
      <Файл xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" ИдФайл=\"#{name}\" ВерсПрог=\"ЭОД v2.4.730.011\" ВерсФорм=\"5.02\">
    <Документ КНД=\"1184001\" ДатаДок=\"#{dot_date}\">
      <СвОтпр КодНО=\"6623\" />
      <СвПолуч ПризПолучУП=\"1\"><ПолучЮЛ НаимОрг=\"ЗАО МАО\" ИННЮЛ=\"0194202211\" КПП=\"019000000\" /></СвПолуч>
      <СвНП><НПЮЛ НаимОрг=\"ЗАО МАО\" ИННЮЛ=\"0194202211\" КПП=\"019000000\" /></СвНП>
      <Подписант Должн=\"Предводитель инспекции\"><ФИО Фамилия=\"Чунга\" Имя=\"Чанга\" />
      </Подписант>
      <ИнфСообДок ВидФайлДок=\"1165013\" НомФайлДок=\"14900\" ДатаФайлДок=\"#{dot_date}\" КолФайл=\"1\">
        <ИмяФайл>1165013_#{name}.pdf</ИмяФайл>
      </ИнфСообДок>
    </Документ>
    </Файл>"
  end
end
